#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ddd7f1a-47b7-488e-ada4-dbe6f5f3ec55]
module.keycloak_prod.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4a559f38-b6c4-4c80-b855-d60cf7284579]
module.keycloak_prod.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=339e7afc-03b1-4163-8f41-01bd7a579bc9]
module.keycloak_prod.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1da7fda9-5717-49c3-b2a0-e0c441dfff12]
module.keycloak_prod.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c85f213f-d1a9-4270-8983-cda9fc6891ee]
module.keycloak_prod.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2e979698-38e5-4246-8395-7ad6c709ee9c]
module.keycloak_prod.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=655e2f25-a5e8-4952-b2e2-92e14deb0d2a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2cb2df06-3b1a-4018-bb46-702705830446]
module.keycloak_prod.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4de03736-7216-406b-b988-4cf3b013d7f5]
module.keycloak_prod.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4fe6c67f-6af8-4aec-89fd-fda980f40792]
module.keycloak_prod.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aa26455c-0086-4c85-88db-ca07d8232792]
module.keycloak_prod.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1f2b5b75-f72c-4cd7-a068-91348d41be06]
module.keycloak_prod.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=aa2822d6-979c-4966-a34a-186437cda932]
module.keycloak_prod.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1e725cfb-5f3a-4185-9fa4-1bc033752818]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7664b246-131a-4659-afb6-dd33d238f10b]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=99f9c885-065a-4ff4-94f5-db959a8a20eb]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f01faa6a-3ed7-4ba9-997b-f0e700b4f298]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1063a59d-6c8c-4926-b66b-092fa4a9d848]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3a1046b2-f84f-478d-8660-daf21b43de9c]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f8a805fc-2b9b-403a-be71-8c398e41403b]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=04c24d57-2ce2-4f79-8d82-44eaed51cde6]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c450ee6b-ce68-4198-9795-f62908af3347]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=455685c6-6ade-4f63-878f-f0ad819a2928]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdbf9427-b5d6-4631-a27a-17a1127f4f03]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=56615aeb-96ed-43d3-9c53-11dccf806b55]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2203e377-d967-4f62-9ff8-1d15b35f2894]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2ce7bbdf-ee35-4f6f-88cc-31ced229c071]
module.keycloak_prod.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ffa21011-0f4b-4c01-a56c-dbfde48517a0]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=529524ab-9b37-4a10-8e5d-9c794567c455]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1b5de41d-015e-4d21-869e-b47e2644c181]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=98985797-5f1f-4d5e-89c5-158053344ddd]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fc8bd481-284e-4433-97cf-1a2791cf4c16]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ceaff0b0-8c9f-4c41-a33b-c59a05a03e0b]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9498d40f-3cb2-4924-abb5-86ededda3cf3]
module.keycloak_prod.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7cb63b99-0fbd-4be1-b949-be9e39c8b8cb]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6c4207d8-507b-4397-a0c9-2595adb3f370]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=487ca7bf-51f5-4f7a-b597-b5b787511949]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0c381275-dcdd-4bac-857d-f7e90a7b6b04]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=679ae43c-b1ff-4f7c-9eab-fe33f7400449]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=62c33ff0-61c5-478f-bcff-60cc6b08bf46]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d6c596cc-08f6-4991-904d-7799362900a6]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=af90f0fc-8d1f-4b4e-997d-979a95703555]
module.keycloak_prod.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e69cf509-b6ec-4e8f-952f-ad91ac9b6062]
module.keycloak_prod.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c730e9b7-3c0b-4aa6-9c3a-fc689e8aebe5]
module.keycloak_prod.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f0a5963e-519c-44ea-852d-1177b04847a5]
module.keycloak_prod.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=063c69eb-d5ac-4ee3-b8e4-0b8171ac6a95]
module.keycloak_prod.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=311cbf6d-33c1-4b2d-8a89-5cfb51a630d1]
module.keycloak_prod.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3b11074c-69a4-42d8-b319-82a5345a3788]
module.keycloak_prod.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c5709583-15cf-4c45-acac-3457af8ddc19]
module.keycloak_prod.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5d30387d-e542-4172-9899-dd550aa8ec0e]
module.keycloak_prod.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b9f0dae0-b946-4754-b59d-6ad0a6ac4e3a]
module.keycloak_prod.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=9e00c08f-9aea-4880-922e-3c83b3ad4b8d]
module.keycloak_prod.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=be8e20ef-dc0a-4718-8c8d-9496c59b6216]
module.keycloak_prod.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=63c379ed-a6f3-4677-9ba5-70db33cc4e6c]
module.keycloak_prod.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c7ccf12a-8b5a-4e34-af77-e047ca7d9fa9]
module.keycloak_prod.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5e5976b7-0bb8-4dca-ae13-d68405a92743]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e68683c1-2c8d-42c2-be14-f5d15204efb8]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c19c1445-de42-4e96-8658-14beb557c599]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=840c3579-34b1-4539-bb0b-5c72a2371696]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=76da18c1-698a-4cac-98d1-f96e42fea05f]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8a6e6a22-5b6d-4641-9130-75e7d56c8e8c]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=491a573e-c393-402a-be09-616c16b164f1]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1192dd1d-933d-4695-9db5-6cb95f68dfa8]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d493cc8a-7bce-4676-8316-a9f3100b59f7]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=552d7d72-58e1-463e-bd7b-c57c70a95a2a]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=54a520a1-78f0-475e-b1bf-f480bc485eae]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=003cf642-2daa-425c-ba40-6c348cecd3d5]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a60895e6-31eb-49b6-b120-a599a8f55155]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=87306e94-70d5-484f-aa0d-21dbbce7de00]
module.keycloak_prod.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5743c3f6-d617-4d65-8cba-3e4fde74b0d8]
module.keycloak_test.module.onestopauth_basic.module.client_a-2938.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=049a894e-ad74-4d60-b19e-ed6a569d6565]
module.keycloak_prod.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6e070bc7-dce1-4f13-bda1-fc760bc92eda]
module.keycloak_prod.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=45407cf9-c8bc-40da-8e0d-5fe8f235ed80]
module.keycloak_prod.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=edbb97f4-5d95-452d-8cc3-bf7d799619de]
module.keycloak_prod.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=42844794-cea3-4e31-a349-816e025283d2]
module.keycloak_prod.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=789f97ef-83eb-4cef-945d-405294c7a839]
module.keycloak_prod.module.onestopauth.module.client_test-958.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b3e3b342-34c3-48e5-becf-a595b8dcec14]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=746eb713-ab30-4974-b7a7-eb0d3d0c856b]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d83711fc-4898-431a-abef-f42bdafae807]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b3ae65d6-7212-49b9-a40a-77d448343289]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0c24fe36-cf7d-4789-bec8-484065f5265e]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d133566a-2560-4046-971b-43be882b8b97]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0477efdc-18ca-4b68-b0f0-37050645d255]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f79b9d8b-0ddb-4773-b0d7-eea40f3e9fd7]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3c77813e-ea25-4f8d-a414-5f63f856ed9f]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c40ba8ac-cbab-4622-a68b-d3273a454ec2]
module.keycloak_prod.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8ae279b7-44a4-4cc6-bc29-da303eb14ff3]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ba334adb-6fa7-4bfc-9918-3a9a54c73c69]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5ebb727d-8fca-4e8b-8075-ec64828e6255]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=361bb68d-6eb7-4669-86ed-4c945bda5677]
module.keycloak_prod.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b8bd22c9-0a5f-47f1-89da-4430b016d0ea]
module.keycloak_prod.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=743961f2-c1d4-4458-8172-bd7eafe4693f]
module.keycloak_prod.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0561173c-7ef1-4759-b8c5-ba9e71db9128]
module.keycloak_prod.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f9686481-ae83-4944-9ebd-0a61f564f579]
module.keycloak_prod.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c7eed32e-5be5-46d4-b577-283ae84fe99e]
module.keycloak_prod.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75f9ce4f-a33f-4b96-80ec-5c9e82703886]
module.keycloak_prod.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=23423469-ad91-4a52-977c-86b2c45ab5e5]
module.keycloak_prod.module.onestopauth.module.client_aug-11-test-843-529.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=963028a8-cb85-443d-b190-449c80ec7b50]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a45ac277-2314-437e-92a0-332439d59ec6]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a4ec439f-08a7-40e4-91f3-2cb4c8b768bd]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=acac31f3-7524-4515-bfbc-01c8b88b3c10]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=70b9e7d4-e6fb-407e-9306-50e4b49c0583]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f4aaa909-017b-4186-b7e0-8b3486e23627]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2b272d47-bf36-4046-9626-b26cfbb70dd3]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a97f8d65-8bdf-40bf-9861-cdedb7823ab2]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9425db28-1d87-4f78-bb8d-e130fd212637]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4d0086b5-0c2d-43fc-9dc3-3df68f97dced]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c0ed030e-212e-4205-8c98-99379ef0de0d]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d122ce84-57a4-4707-bfbf-2e0fd92d676e]
module.keycloak_prod.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6181de42-66e2-41ad-b616-286163f50ae9]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=af998328-19ae-4315-b74c-9778ae964a60]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c521c294-6011-4021-bb19-df0c4fcfeeec]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ad2d066f-0af2-4dad-b954-e5fe318f905c]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3eabec79-8d9b-4468-b702-22e6bbc19cb7]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=68f25c92-da3a-463d-8c17-a85d2505c040]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0b978cd4-a115-4c44-a1db-3c0c46bbef34]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6278e041-db21-4e67-8f39-54471e5ef0e1]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fd5e656-ccf1-41de-9452-b81b3f9f3fd1]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8afc996b-849d-4bbf-a0a3-3f6459a92d13]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8f14e273-5f8e-446b-9350-093b3f75a875]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7cd7e36c-d2b6-4788-9452-334193ed8871]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=accb4620-9139-4614-adcf-c6cee0a5cee6]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6e62d39c-ec8d-4706-88bd-8aa7507d3924]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=569a6aa0-81eb-4b45-8c6d-1b4aaa86ee6f]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6bcc43f9-4b48-4211-b5d0-4f88864fc33f]
module.keycloak_prod.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ac281a9e-ec7b-43d5-872b-3489e83d35b1]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7f44ef42-a9d1-409c-9ce0-168d680956ca]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cdef4b98-07dd-454e-bd35-716c44053717]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=04f15480-a480-4521-9ee4-b6b45e300d29]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=882853bb-bf48-4698-b2bb-103fda3748ec]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0fe9e1ce-b106-4b12-ba6c-284f60baf198]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b7fc4689-c53c-46c4-a5ce-f3a8cacb44fa]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=61182e46-69f7-48e4-9123-a416cd756b42]
module.keycloak_prod.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1857a679-9e33-4fc9-8900-3e1637d5fee8]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4faad465-1e05-487f-9e2c-d09c78e37c95]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dc0e2750-aad7-4a56-af72-ec14d64b9835]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=34fe8125-8207-4620-b672-6349c58fce3f]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c4b405e-48c4-424e-ad46-c05ddf8187c6]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=92eb1cbb-06ee-4202-b84d-271911fd135f]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ccebffe8-4187-478b-92ae-2632a8966fb9]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ff88a994-be08-44df-b44e-32af353ea455]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=397a371a-c3bc-4ef8-9d20-18414214e53e]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4d8b0ab9-6735-4909-b42e-495a6735d79e]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d9344419-c5ef-48b6-8127-d8bac4b52dac]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b2f395d9-c4dc-4af8-a9dc-a034eff0399b]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=811301f7-6066-49a4-af86-000e2a0635b6]
module.keycloak_prod.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=dbc177a4-8e42-4161-a701-9af55738d0c1]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb2929ff-738b-407e-8717-c13cdb5d6df4]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ca7dec40-8a3d-4d12-8778-2e5ee1d2da31]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=af8edbe9-cd7e-45bb-a277-0047cef330a1]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ef729f29-c171-4a24-b577-9afcf1698904]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=aa1c58fe-b390-45a2-8b80-8a547f5e1ac1]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6282f1b9-e1a3-4944-a309-71bc7506e4b2]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7e733e27-8199-459f-89ec-89a0dd235bcb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-dev-test-3005"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-dev-test-3005"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-dev-test-3005"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-dev-test-3005"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://dev",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-dev-test-3005"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-dev-test-3005"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_bceid-dev-test-3005.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-dev-test-3005"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-dev-test-3005"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2856 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*